# Análise Exploratória

### Bibliotecas

In [1]:
import numpy as np
import pandas as pd

### Localizando as bases de dados no diretório

In [2]:
ls "../Datasets/*.csv"

 O volume na unidade C ‚ Windows
 O N£mero de S‚rie do Volume ‚ 8ED9-8750

 Pasta de C:\Github\Desafio Bemol\Datasets

29/08/2021  16:16         1.848.369 dataset_questao1.csv
29/08/2021  16:16           136.819 dataset_questao2.csv
               2 arquivo(s)      1.985.188 bytes
               0 pasta(s)   61.642.424.320 bytes dispon¡veis

### Realizando a leitura das bases de dados

In [3]:
df1 = pd.read_csv("../Datasets/dataset_questao1.csv")

In [4]:
df2 = pd.read_csv("../Datasets/dataset_questao2.csv")

## Visão Geral - Dataset Questão 1

In [5]:
df1.sample()

,num_compra,cliente,vendedor,tipo_de_mercadoria,filial,data_compra,valor_compra,imposto,cpf_na_nota,produto_devolvido,motivo_devolucao
12686,21879469,123747,JOSENIRA,CHAPA/FRITADEIRA IND,Loja Itacoatiara,2020-01-17 17:51:35.000,45.692,2.05614,Não,Não,Sem devolução

In [6]:
df1.dtypes

num_compra              int64
cliente                 int64
vendedor               object
tipo_de_mercadoria     object
filial                 object
data_compra            object
valor_compra          float64
imposto               float64
cpf_na_nota            object
produto_devolvido      object
motivo_devolucao       object
dtype: object

In [7]:
df1.shape

(13877, 11)

In [8]:
df1.describe()

         num_compra        cliente  valor_compra       imposto
count  1.387700e+04   13877.000000  13877.000000  13877.000000
mean   2.373366e+07  186941.049723    132.021628      5.940973
std    1.378146e+06  127108.741747    788.208066     35.469363
min    2.184217e+07     295.000000      0.304000      0.013680
25%    2.244832e+07   76698.000000     10.384000      0.467280
50%    2.367986e+07  182834.000000     23.996000      1.079820
75%    2.491794e+07  277666.000000     54.776000      2.464920
max    2.629532e+07  466595.000000  24845.040000   1118.026800

## Visão Geral - Dataset Questão 2

In [9]:
df2.sample()

,cod_loja,data_compra,inicio,termino,loja,cod_produto,produto,ean,valor_unitario_sem_imposto,quantidade,valor_total,impostos,dinheiro_de_volta
69,410,2019-07-06 12:56:11,2019-07-05 00:00:00,2019-07-20 00:00:00,Unidade Manaus 1,49618556000135,Smart Pro,190199383180,3000,2,6662.58,752.58,90.0

In [10]:
df2.dtypes

cod_loja                        int64
data_compra                    object
inicio                         object
termino                        object
loja                           object
cod_produto                     int64
produto                        object
ean                             int64
valor_unitario_sem_imposto      int64
quantidade                      int64
valor_total                   float64
impostos                      float64
dinheiro_de_volta             float64
dtype: object

In [11]:
df2.shape

(899, 13)

In [12]:
df2.describe()

,cod_loja,cod_produto,ean,valor_unitario_sem_imposto,quantidade,valor_total,impostos,dinheiro_de_volta
count,899.000000,8.990000e+02,8.990000e+02,899.000000,899.000000,899.000000,899.000000,899.000000
mean,419.299221,4.961856e+13,3.700537e+11,2441.323693,1.416018,3668.803902,414.414302,49.559232
std,9.980968,4.042427e+01,2.627831e+11,816.275373,1.006886,2274.318673,256.898491,30.722135
min,410.000000,4.961856e+13,1.901994e+11,1250.000000,1.000000,1388.037500,156.787500,18.750000
25%,410.000000,4.961856e+13,1.901994e+11,1250.000000,1.000000,2776.075000,313.575000,37.500000
50%,410.000000,4.961856e+13,1.901994e+11,3000.000000,1.000000,3331.290000,376.290000,45.000000
75%,430.000000,4.961856e+13,7.535760e+11,3000.000000,2.000000,3331.290000,376.290000,45.000000
max,430.000000,4.961856e+13,7.535760e+11,3000.000000,18.000000,26650.320000,3010.320000,360.000000

# Análises Dataset Questão 1

- Funções auxiliares

In [13]:
moeda = lambda numero : '{:,.2f}'.format(numero).replace(".","*").replace(",",".").replace("*",",")
casas = lambda numero : '{:,}'.format(numero).replace(",",".")

### Quantidade de clientes

In [14]:
clientes = df1.cliente.unique()
clientes.__len__()

730

### Quantidade de vendedores

In [15]:
vendedores = df1.vendedor.unique()
vendedores.__len__()

510

### Quantidade de produtos

In [16]:
produtos = df1.tipo_de_mercadoria.unique()
produtos.__len__()

857

### Quantidade de filiais

In [17]:
filiais = df1.filial.unique()
filiais.__len__()

5

### Os nomes das lojas filiais

In [18]:
list(filiais)

['Loja Autazes',
 'Loja Manicoré',
 'Loja Lábrea',
 'Loja Itacoatiara',
 'Loja Manacapuru']

### Os motivos de devoluções

In [19]:
motivos = df1.motivo_devolucao.unique()
list(motivos)

['Sem devolução',
 'Antecipação de troca',
 'Insatisfação com o produto',
 'Problema na Entrega',
 'Insatisfação com o atendimento',
 'Defeito do produto']

### Quantidade de compras e a soma das compras de cada cliente

In [20]:
quantidade = np.array([])
soma = np.array([])

for cliente in clientes:
    condicao = df1.cliente == cliente
    compras = df1[condicao].valor_compra
    soma = np.append(soma, compras.sum())
    quantidade = np.append(quantidade, compras.count())

colunas = ["Cliente", "Qtde_Compras", "Soma_Compras"]
dados = [clientes, quantidade, soma]

dataframe1 = pd.DataFrame(dados, index=colunas).T

In [21]:
dataframe1

      Cliente  Qtde_Compras  Soma_Compras
0       295.0          22.0      4853.068
1       331.0          21.0     11262.288
2       370.0          21.0     24481.072
3       460.0          21.0     18042.312
4       538.0          21.0      9149.336
..        ...           ...           ...
725  465263.0          17.0      5301.628
726  465620.0          17.0      3278.040
727  466079.0          17.0      1375.576
728  466205.0          17.0      1865.080
729  466595.0          17.0       566.956

[730 rows x 3 columns]

### O cliente que mais realizou compras

In [22]:
dataframe1.sort_values(by=["Qtde_Compras"], ascending=False).head(1)

   Cliente  Qtde_Compras  Soma_Compras
0    295.0          22.0      4853.068

### O cliente que mais gastou em compras

In [23]:
dataframe1.sort_values(by=["Soma_Compras"], ascending=False).head(1)

      Cliente  Qtde_Compras  Soma_Compras
511  266970.0          19.0     28550.036

### Total de compras realizadas

In [24]:
casas(dataframe1.Qtde_Compras.sum().astype(int))

'13.877'

### Faturamento

In [25]:
moeda(dataframe1.Soma_Compras.sum())

'1.832.064,13'

### Quantos clientes registraram CPF na nota

In [26]:
casas(df1.query("cpf_na_nota == 'Sim'")["cpf_na_nota"].count())

'11.908'

### Quantos clientes não cadastraram CPF na nota

In [27]:
casas(df1.query("cpf_na_nota == 'Não'")["cpf_na_nota"].count())

'1.969'

### O total de cada motivo de devolução

In [28]:
total_motivos = np.array([])

for motivo in motivos:
    total = df1.query(f"motivo_devolucao == '{motivo}'")["motivo_devolucao"].count()
    total_motivos = np.append(total_motivos, (motivo, total))

In [29]:
total = total_motivos.reshape((6,2))
dataframe2 = pd.DataFrame.from_records(total, columns=['Motivos', 'Total'])
dataframe2

                          Motivos Total
0                   Sem devolução  6962
1            Antecipação de troca  1368
2      Insatisfação com o produto  1385
3             Problema na Entrega  1369
4  Insatisfação com o atendimento  1354
5              Defeito do produto  1439

###  O maior motivo de devolução de produtos

In [30]:
data = dataframe2.sort_values(by=["Total"], ascending=False)
data.iloc[1:2,0:2]

              Motivos Total
5  Defeito do produto  1439

###  O menor motivo de devolução de produtos

In [31]:
data.iloc[-1:,0:2]

                          Motivos Total
4  Insatisfação com o atendimento  1354

###  Os produtos mais vendidos

In [32]:
vendidos = df1.tipo_de_mercadoria.value_counts()

dataframe3 = pd.DataFrame([vendidos.index, vendidos.values], index=["Produtos","Vendidos"]).T
dataframe3

                 Produtos Vendidos
0     SPLIT 18001 À 30000      103
1     SPLIT 10001 À 18000      103
2     TV LED DE 48" À 54"       25
3    SMART MULTISIM LIVRE       25
4     TV LED DE 40" À 43"       25
..                    ...      ...
852    ABSORVENTE P/SEIOS       11
853      GEL ANTISSÉPTICO       11
854  FORT D CABELOS E UNH       11
855    PROTETOR DE MAMILO       11
856          UMIDIFICADOR       11

[857 rows x 2 columns]

###  O total de devoluções de cada produto

In [33]:
condicao = df1.produto_devolvido == "Sim"
devolvidos = df1[condicao].tipo_de_mercadoria.value_counts()
dataframe4 = pd.DataFrame([devolvidos.index, devolvidos.values], index=["Produtos", "Devolvidos"]).T
dataframe4

                 Produtos Devolvidos
0     SPLIT 10001 À 18000         57
1     SPLIT 18001 À 30000         55
2     TV LED DE 48" À 54"         19
3    TANQUINHO/SEMI-AUTOM         16
4           TV LED DE 32"         16
..                    ...        ...
852  KIT COZINHA DE MADEI          3
853      TOALHA UMEDECIDA          3
854               ADEGA 1          2
855      SABONETE LÍQUIDO          2
856  ARQ/GAVETEIRO ESCRIT          2

[857 rows x 2 columns]

### O produto com mais devoluções

In [34]:
dataframe4.head(1)

              Produtos Devolvidos
0  SPLIT 10001 À 18000         57

###  O produto com menos devoluções

In [35]:
dataframe4.tail(1)

                 Produtos Devolvidos
856  ARQ/GAVETEIRO ESCRIT          2

###  O total de imposto de cada produto

In [36]:
icms = np.array([])

for produto in produtos:
    condicao = df1.tipo_de_mercadoria == produto
    imposto = df1[condicao].imposto.sum()
    icms = np.append(icms, imposto)
    
dataframe5 = pd.DataFrame([produtos, icms], index=["Produtos","Imposto"]).T.sort_values(by=["Imposto"], ascending=False)
dataframe5

                 Produtos    Imposto
3     SPLIT 10001 À 18000  9478.9764
4     SPLIT 18001 À 30000  7004.4372
2    SPLIT ACIMA DE 30000  3900.1932
14    TV LED DE 48" À 54"  3750.9372
412  SPLIT INV18001À30000  3211.3476
..                    ...        ...
803    AGULHAS E SERINGAS   11.11194
328       TELEVISOR LCD 2   10.82466
456      AR COND JANELA 2   10.38888
466           BEBEDOURO 2    9.99288
331           GELADEIRA 1     9.4725

[857 rows x 2 columns]

### O total de imposto dos produtos

In [37]:
moeda(dataframe5.Imposto.sum())

'82.442,89'

### O produto vendido que pagou mais imposto

In [38]:
dataframe5.head(1)

              Produtos    Imposto
3  SPLIT 10001 À 18000  9478.9764

### O produto vendido que pagou menos imposto

In [39]:
dataframe5.tail(1)

        Produtos Imposto
331  GELADEIRA 1  9.4725

### O total do valor de vendas de cada produto em cada filial

In [40]:
lista_dataframes = dict()

for loja in filiais:
    vendas = np.array([])
    
    for produto in produtos:
        condicao1 = df1.filial == loja
        condicao2 = df1.tipo_de_mercadoria == produto
        
        soma = df1[condicao1 & condicao2].valor_compra.sum()
        vendas = np.append(vendas, soma)
        
    dataframe6 = pd.DataFrame([produtos, vendas], index=["Produtos", "Valor_Vendas"]).T
    lista_dataframes[loja] = dataframe6.sort_values(by=["Valor_Vendas"], ascending=False)

### Total de Vendas da Loja Autazes

In [41]:
lista_dataframes['Loja Autazes']

                Produtos Valor_Vendas
4    SPLIT 18001 À 30000     26467.92
3    SPLIT 10001 À 18000     24860.88
0     SPLIT 8501 À 10000     10045.68
17         TV 4K ATÉ 59"      9579.36
12         TV LED DE 32"       9091.2
..                   ...          ...
129    CONJ LOUÇA JANTAR          0.0
135     COMPL COZ DE AÇO          0.0
130             CAÇAROLA          0.0
382  ACESS. P/ BICICLETA          0.0
270  FILTRO M CONSTRUÇÃO          0.0

[857 rows x 2 columns]

### Total de Vendas da Loja Manicoré

In [42]:
lista_dataframes['Loja Manicoré']

                 Produtos Valor_Vendas
3     SPLIT 10001 À 18000    117295.68
4     SPLIT 18001 À 30000      58812.0
412  SPLIT INV18001À30000     58611.12
14    TV LED DE 48" À 54"     56574.24
2    SPLIT ACIMA DE 30000     42071.76
..                    ...          ...
788     HIDRATANTE FACIAL        8.692
819      GEL ANTISSÉPTICO        8.348
258  CONJ PLAYSET/MENINOS        6.208
465         RÁDIOS AUTO 2         5.94
793    MEIA DE COMPRESSÃO          0.0

[857 rows x 2 columns]

### Total de Vendas da Loja Lábrea

In [43]:
lista_dataframes['Loja Lábrea']

                Produtos Valor_Vendas
3    SPLIT 10001 À 18000      62978.4
4    SPLIT 18001 À 30000     60448.56
478  TV LED ACIMA DE 65"     24965.52
64   SPLIT ATÉ 8500 BTUS     21507.12
471   TV 4K ACIMA DE 69"     16160.88
..                   ...          ...
546    FIO E FITA DENTAL        2.792
110            LIXADEIRA        2.356
780             CURATIVO        1.796
300             NOTEBOOK        0.792
113            MARTELETE          0.0

[857 rows x 2 columns]

### Total de Vendas da Loja Itacoatiara

In [44]:
lista_dataframes['Loja Itacoatiara']

                 Produtos Valor_Vendas
500        TV OLED / QLED      45852.0
19    TV LED DE 21" À 24"     17841.84
514       AR COND SPLIT 2     17184.24
14    TV LED DE 48" À 54"      9811.92
18     TV 4K DE 60" À 69"      9003.12
..                    ...          ...
162  BRINC E FAZ DE CONTA          0.0
166               CERCADO          0.0
554         LUBRIFICANTES          0.0
716  ANTIGLAUCOMATOSO REF          0.0
667          TALCO P/ PÉS          0.0

[857 rows x 2 columns]

### Total de Vendas da Loja Manacapuru

In [45]:
lista_dataframes['Loja Manacapuru']

                 Produtos Valor_Vendas
2    SPLIT ACIMA DE 30000     26137.68
19    TV LED DE 21" À 24"      9174.72
284   TV LED DE 55" À 59"      7087.44
471    TV 4K ACIMA DE 69"      6273.36
412  SPLIT INV18001À30000      5434.32
..                    ...          ...
695      ANTIASMÁTICO REF          0.0
833      SORVETE E PICOLÉ          0.0
834   TÔNICO ADSTRINGENTE          0.0
835    ACESS DE MAQUIAGEM          0.0
222     ACESS DE MEDICINA          0.0

[857 rows x 2 columns]

### O total de vendas em cada filial e o montante em vendas

In [46]:
qtde_vendas = np.array([])
soma_vendas = np.array([])

for loja in filiais:
    condicao = df1.filial == loja
    vendas = df1[condicao].valor_compra
    
    qtde_vendas = np.append(vendas.count(), qtde_vendas)
    soma_vendas = np.append(vendas.sum(), soma_vendas)
    
dataframe7 = pd.DataFrame([filiais, qtde_vendas.astype(int), soma_vendas], index=["Unidades", "Total_Vendas", "Soma_Vendas"]).T
dataframe7

           Unidades Total_Vendas Soma_Vendas
0      Loja Autazes         1793  156479.604
1     Loja Manicoré         1214  234666.368
2       Loja Lábrea         4072  446117.764
3  Loja Itacoatiara         4085   794482.76
4   Loja Manacapuru         2713  200317.632

###  A filial com mais vendas

In [47]:
dataframe7.query(f"Total_Vendas == {dataframe7.Total_Vendas.max()}")

           Unidades Total_Vendas Soma_Vendas
3  Loja Itacoatiara         4085   794482.76

###  A filial com menos vendas

In [48]:
dataframe7.query(f"Total_Vendas == {dataframe7.Total_Vendas.min()}")

        Unidades Total_Vendas Soma_Vendas
1  Loja Manicoré         1214  234666.368

###  A filial que mais faturou em vendas

In [49]:
dataframe7.query(f"Soma_Vendas == {dataframe7.Soma_Vendas.max()}")

           Unidades Total_Vendas Soma_Vendas
3  Loja Itacoatiara         4085   794482.76

###  A filial que menos faturou em vendas

In [50]:
dataframe7.query(f"Soma_Vendas == {dataframe7.Soma_Vendas.min()}")

       Unidades Total_Vendas Soma_Vendas
0  Loja Autazes         1793  156479.604

###  O total de devoluções em cada filial

In [51]:
devolucoes = np.array([])

for loja in filiais:
    condicao1 = df1.produto_devolvido == "Sim"
    condicao2 = df1.filial == loja
    soma = df1[condicao1 & condicao2].produto_devolvido.count()
    devolucoes = np.append(devolucoes, soma)

In [52]:
unidades = pd.DataFrame.from_records(filiais.reshape(5,1))
devolvidos = pd.DataFrame.from_records(devolucoes.reshape(5,1))

In [53]:
dataframe8 = pd.concat([unidades, devolvidos], axis=1)
dataframe8.columns = ["Unidades", "Produtos_Devolvidos"]
dataframe8

           Unidades  Produtos_Devolvidos
0      Loja Autazes               1345.0
1     Loja Manicoré               2008.0
2       Loja Lábrea               2025.0
3  Loja Itacoatiara                636.0
4   Loja Manacapuru                901.0

### A unidade que teve muitas devoluções de produtos

In [54]:
dataframe8[dataframe8.Produtos_Devolvidos ==  dataframe8.Produtos_Devolvidos.max()]

      Unidades  Produtos_Devolvidos
2  Loja Lábrea               2025.0

### A unidade que teve poucas devoluções de produtos

In [55]:
dataframe8[dataframe8.Produtos_Devolvidos ==  dataframe8.Produtos_Devolvidos.min()]

           Unidades  Produtos_Devolvidos
3  Loja Itacoatiara                636.0

### O total de vendas sem devoluções em cada filial

In [56]:
devolucoes = np.array([])

for loja in filiais:
    condicao1 = df1.produto_devolvido == "Não"
    condicao2 = df1.filial == loja
    condicao3 = df1.motivo_devolucao == "Sem devolução"
    soma = df1[condicao1 & condicao2 & condicao3].produto_devolvido.count()
    devolucoes = np.append(devolucoes, soma)

In [57]:
dataframe9 = pd.DataFrame([filiais, devolucoes], index=["Unidades", "Vendas_Sem_Produtos_Devolvidos"]).T
dataframe9

           Unidades Vendas_Sem_Produtos_Devolvidos
0      Loja Autazes                         1368.0
1     Loja Manicoré                         2077.0
2       Loja Lábrea                         2047.0
3  Loja Itacoatiara                          578.0
4   Loja Manacapuru                          892.0

### A unidade as maiores vendas sem devoluções de produtos

In [58]:
dataframe9.query(f"Vendas_Sem_Produtos_Devolvidos == {dataframe9.Vendas_Sem_Produtos_Devolvidos.max()}")

        Unidades Vendas_Sem_Produtos_Devolvidos
1  Loja Manicoré                         2077.0

### A unidade as menores vendas sem devoluções de produtos

In [59]:
dataframe9.query(f"Vendas_Sem_Produtos_Devolvidos == {dataframe9.Vendas_Sem_Produtos_Devolvidos.min()}")

           Unidades Vendas_Sem_Produtos_Devolvidos
3  Loja Itacoatiara                          578.0

### Quantidade do maior motivo de devolução de produtos em cada filial

In [60]:
quantidade = np.array([])
motivo_devolucao = np.array([])

for loja in filiais:
    condicao1 = df1.filial == loja
    condicao2 = df1.motivo_devolucao != "Sem devolução"
    soma = df1[condicao1 & condicao2].motivo_devolucao.value_counts() 
    
    quantidade = np.append(quantidade, soma.values[0])
    motivo_devolucao = np.append(motivo_devolucao, soma.index[0])
    
dataframe10 = pd.DataFrame([filiais, motivo_devolucao, quantidade.astype(int)], index=["Unidades", "Principais_Motivos", "Quantidade"]).T
dataframe10

           Unidades              Principais_Motivos Quantidade
0      Loja Autazes              Defeito do produto        289
1     Loja Manicoré              Defeito do produto        421
2       Loja Lábrea            Antecipação de troca        439
3  Loja Itacoatiara  Insatisfação com o atendimento        133
4   Loja Manacapuru              Defeito do produto        207

### A unidade que teve a maior quantidade de devoluções de produtos e o principal motivo de devolução

In [61]:
maior = dataframe10.Quantidade.max()
dataframe10[dataframe10.Quantidade == maior]

      Unidades    Principais_Motivos Quantidade
2  Loja Lábrea  Antecipação de troca        439

### A unidade que teve a menor quantidade de devoluções de produtos e o principal motivo de devolução

In [62]:
menor = dataframe10.Quantidade.min()
dataframe10[dataframe10.Quantidade == menor]

           Unidades              Principais_Motivos Quantidade
3  Loja Itacoatiara  Insatisfação com o atendimento        133

## Dataframes gerados

In [63]:
dataframe1.to_excel("../Datasets/Analises/Quantidade de compras e a soma das compras de cada cliente.xlsx", index=False)
dataframe1.head()

   Cliente  Qtde_Compras  Soma_Compras
0    295.0          22.0      4853.068
1    331.0          21.0     11262.288
2    370.0          21.0     24481.072
3    460.0          21.0     18042.312
4    538.0          21.0      9149.336

In [64]:
dataframe2 = dataframe2.sort_values(by=["Total"], ascending=False)
dataframe2.to_excel("../Datasets/Analises/O total de cada motivo de devolução.xlsx", index=False)
dataframe2.head()

                      Motivos Total
0               Sem devolução  6962
5          Defeito do produto  1439
2  Insatisfação com o produto  1385
3         Problema na Entrega  1369
1        Antecipação de troca  1368

In [65]:
dataframe3.to_excel("../Datasets/Analises/Os produtos mais vendidos.xlsx", index=False)
dataframe3.head()

               Produtos Vendidos
0   SPLIT 18001 À 30000      103
1   SPLIT 10001 À 18000      103
2   TV LED DE 48" À 54"       25
3  SMART MULTISIM LIVRE       25
4   TV LED DE 40" À 43"       25

In [66]:
dataframe4.to_excel("../Datasets/Analises/O total de devoluções de cada produto.xlsx", index=False)
dataframe4.head()

               Produtos Devolvidos
0   SPLIT 10001 À 18000         57
1   SPLIT 18001 À 30000         55
2   TV LED DE 48" À 54"         19
3  TANQUINHO/SEMI-AUTOM         16
4         TV LED DE 32"         16

In [67]:
dataframe5.to_excel("../Datasets/Analises/O total de imposto de cada produto.xlsx", index=False)
dataframe5.head()

                 Produtos    Imposto
3     SPLIT 10001 À 18000  9478.9764
4     SPLIT 18001 À 30000  7004.4372
2    SPLIT ACIMA DE 30000  3900.1932
14    TV LED DE 48" À 54"  3750.9372
412  SPLIT INV18001À30000  3211.3476

In [68]:
for unidade, data in lista_dataframes.items():
    print("***************",unidade,"***************")
    data = data.sort_values(by=["Valor_Vendas"], ascending=False)
    data.to_excel(f"../Datasets/Analises/{unidade} - O total do valor de vendas de cada produto em cada filial.xlsx", index=False)
    print(data.head())

*************** Loja Autazes ***************
               Produtos Valor_Vendas
4   SPLIT 18001 À 30000     26467.92
3   SPLIT 10001 À 18000     24860.88
0    SPLIT 8501 À 10000     10045.68
17        TV 4K ATÉ 59"      9579.36
12        TV LED DE 32"       9091.2
*************** Loja Manicoré ***************
                 Produtos Valor_Vendas
3     SPLIT 10001 À 18000    117295.68
4     SPLIT 18001 À 30000      58812.0
412  SPLIT INV18001À30000     58611.12
14    TV LED DE 48" À 54"     56574.24
2    SPLIT ACIMA DE 30000     42071.76
*************** Loja Lábrea ***************
                Produtos Valor_Vendas
3    SPLIT 10001 À 18000      62978.4
4    SPLIT 18001 À 30000     60448.56
478  TV LED ACIMA DE 65"     24965.52
64   SPLIT ATÉ 8500 BTUS     21507.12
471   TV 4K ACIMA DE 69"     16160.88
*************** Loja Itacoatiara ***************
                Produtos Valor_Vendas
500       TV OLED / QLED      45852.0
19   TV LED DE 21" À 24"     17841.84
514      AR COND SPLIT 2     17184.24
14   TV LED DE 48" À 54"      9811.92
18    TV 4K DE 60" À 69"      9003.12
*************** Loja Manacapuru ***************
                 Produtos Valor_Vendas
2    SPLIT ACIMA DE 30000     26137.68
19    TV LED DE 21" À 24"      9174.72
284   TV LED DE 55" À 59"      7087.44
471    TV 4K ACIMA DE 69"      6273.36
412  SPLIT INV18001À30000      5434.32

In [69]:
dataframe7.to_excel("../Datasets/Analises/O total de vendas em cada filial e o montante em vendas.xlsx", index=False)
dataframe7.head()

           Unidades Total_Vendas Soma_Vendas
0      Loja Autazes         1793  156479.604
1     Loja Manicoré         1214  234666.368
2       Loja Lábrea         4072  446117.764
3  Loja Itacoatiara         4085   794482.76
4   Loja Manacapuru         2713  200317.632

In [70]:
dataframe8 = dataframe8.sort_values(by=["Produtos_Devolvidos"], ascending=False)
dataframe8.to_excel("../Datasets/Analises/O total de devoluções em cada filial.xlsx", index=False)
dataframe8.head()

           Unidades  Produtos_Devolvidos
2       Loja Lábrea               2025.0
1     Loja Manicoré               2008.0
0      Loja Autazes               1345.0
4   Loja Manacapuru                901.0
3  Loja Itacoatiara                636.0

In [71]:
dataframe9 = dataframe9.sort_values(by=["Vendas_Sem_Produtos_Devolvidos"], ascending=False)
dataframe9.to_excel("../Datasets/Analises/O total de vendas sem devoluções em cada filial.xlsx", index=False)
dataframe9.head()

           Unidades Vendas_Sem_Produtos_Devolvidos
1     Loja Manicoré                         2077.0
2       Loja Lábrea                         2047.0
0      Loja Autazes                         1368.0
4   Loja Manacapuru                          892.0
3  Loja Itacoatiara                          578.0

In [72]:
dataframe10 = dataframe10.sort_values(by=["Quantidade"], ascending=False)
dataframe10.to_excel("../Datasets/Analises/Quantidade do maior motivo de devolução de produtos em cada filial.xlsx", index=False)
dataframe10.head()

           Unidades              Principais_Motivos Quantidade
2       Loja Lábrea            Antecipação de troca        439
1     Loja Manicoré              Defeito do produto        421
0      Loja Autazes              Defeito do produto        289
4   Loja Manacapuru              Defeito do produto        207
3  Loja Itacoatiara  Insatisfação com o atendimento        133

# Análise Dataset - Questão 2

### Vendas por dia nas filiais

In [73]:
datas = pd.to_datetime(df2.data_compra.unique())
anos = set()
meses = set()
dias = set()

for data in datas:
    anos.add(data.strftime("%Y"))
    meses.add(data.strftime("%m"))
    dias.add(data.strftime("%d"))

In [74]:
anos

{'2019'}

In [75]:
meses

{'07'}

In [76]:
dias

{'02', '03', '04', '05', '06', '07', '08'}

In [77]:
dados = {"Loja":[], "Data": [], "Vendas":[]}

for dia in dias:
    data = f"2019-07-{dia}"
    condicao1 = df2.data_compra.str.contains(data)
    dataframe = df2[condicao1][["loja","data_compra"]] 
    lojas = dataframe.loja.unique()

    for loja in lojas:
        condicao2 = dataframe.loja == loja
        vendas = dataframe[condicao1 & condicao2].data_compra.count()
        data_reversa = f"{dia}-07-2019"
        dados["Loja"].append(loja)
        dados["Data"].append(data_reversa)
        dados["Vendas"].append(vendas)

<ipython-input-77-d49f445903c3>:11: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  vendas = dataframe[condicao1 & condicao2].data_compra.count()

In [78]:
tabela11 = pd.DataFrame(dados)

In [79]:
tabela11.sort_values(by=["Data","Vendas"], ascending=False)

                Loja        Data  Vendas
4   Unidade Manaus 3  08-07-2019      68
3   Unidade Manaus 1  08-07-2019      60
1   Unidade Manaus 1  07-07-2019     105
2   Unidade Manaus 3  07-07-2019      83
10  Unidade Manaus 1  06-07-2019     105
11  Unidade Manaus 3  06-07-2019      89
8   Unidade Manaus 1  05-07-2019      47
9   Unidade Manaus 3  05-07-2019      46
7   Unidade Manaus 1  04-07-2019      25
0   Unidade Manaus 1  03-07-2019      31
6   Unidade Manaus 3  02-07-2019     132
5   Unidade Manaus 1  02-07-2019     108

### Unidade que teve o dia com mais vendas

In [80]:
tabela11[tabela11.Vendas == tabela11.Vendas.max()]

               Loja        Data  Vendas
6  Unidade Manaus 3  02-07-2019     132

### Unidade que teve o dia com menos vendas

In [81]:
tabela11[tabela11.Vendas == tabela11.Vendas.min()]

               Loja        Data  Vendas
7  Unidade Manaus 1  04-07-2019      25

### Média de Vendas

In [82]:
media = (tabela11.Vendas.sum() // tabela11.Vendas.count())
media

74

### Total de vendas por dia em todas as unidades

In [83]:
datas_unicas = tabela11.Data.unique()
dados = np.array([])

for data in datas_unicas:
    condicao = tabela11.Data == data
    soma = tabela11[condicao].Vendas.sum()
    dados = np.append(dados, (data, soma))

In [84]:
dados = dados.reshape(7,2)
tabela11 = pd.DataFrame.from_records(dados)
tabela11.columns = ["Data", "Total_Vendas"]
tabela11.Total_Vendas = tabela11.Total_Vendas.astype("int")
tabela11

         Data  Total_Vendas
0  03-07-2019            31
1  07-07-2019           188
2  08-07-2019           128
3  02-07-2019           240
4  04-07-2019            25
5  05-07-2019            93
6  06-07-2019           194

### O dia que teve mais vendas

In [85]:
maior_venda = tabela11.Total_Vendas.max()
menor_venda = tabela11.Total_Vendas.min()

In [86]:
tabela11[tabela11.Total_Vendas == maior_venda]

         Data  Total_Vendas
3  02-07-2019           240

### O dia que teve menos vendas

In [87]:
tabela11[tabela11.Total_Vendas == menor_venda]

         Data  Total_Vendas
4  04-07-2019            25